# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the Julia Roch Flores database. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [1]:
%load_ext sql
%config SqlMagic.autocommit = False

In [2]:
#We import the Julia Roch Database provided in Slack by Octavio following appropiate steps
%sql sqlite:///../data/juliarochflores.db

In [4]:
%%sql inner <<

SELECT
    name
FROM
    sqlite_master
WHERE
    type ='table' AND
    name NOT LIKE 'sqlite_%';

 * sqlite:///../data/juliarochflores.db
Done.
Returning data to local variable inner

In [9]:
%%sql inner <<
SELECT
personal_info.id as id,
personal_info.lastName as last_name,
personal_info.country as country,
rank_info.name as ranking,
business_info.worth 
FROM personal_info
join rank_info
on rank_info.id = personal_info.id
join business_info
on business_info.id = rank_info.id
group by country
order by worth DESC;

 * sqlite:///../data/juliarochflores.db
Done.
Returning data to local variable inner

In [10]:
table_1 = inner.DataFrame()
table_1

      id  last_name              country           ranking      worth
0   7500      GATES                 None        bILL GATES  90.0 BUSD
1   7545       tSAI               Canada       josEPH tsai   9.7 BUSD
2   2977       ofER               Israel         EYAL OFEr   9.4 BUSD
3   8365    arNAULt               France   bernARD ARNAULT  72.0 BUSD
4   4945     ortEGa                Spain    amaNCIO ORTega  70.0 BUSD
..   ...        ...                  ...               ...        ...
57  6479    CHRENKO             Slovakia      iVAN CHREnko   1.3 BUSD
58  2716  bierNAcki               Poland  tomasz bIERNacki   1.2 BUSD
59  1630   cISNEROs            Venezuela  gustavo CISNEros   1.1 BUSD
60  8246      weNTz  St. Kitts and Nevis       myRON WENTZ   1.1 BUSD
61  3886   colLISON              Ireland     johN COLLISOn   1.0 BUSD

[62 rows x 5 columns]

# Challenge 2 - Working with JSON files

Import the pandas library.

In [107]:
# your code here
import pandas as pd
import numpy as np

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [89]:
# your code here
df_json = pd.read_json('../data/nasa.json', orient='records')

Now that we have loaded the data, let's examine it using the `head()` function.

In [90]:
# your code here
df_json.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [140]:
# your code here
df_json.fall.value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [141]:
# your code here
df_json.to_json(r'../data/nasa-output.json', orient='records')

# Challenge 3 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [146]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [235]:
# your code here
shuttle = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst', sep=' ', names=cols)
print(shuttle)

    time  rad_flow  fpv_close  fpv_open  high  bypass  bpv_close  bpv_open  \
55     0        81          0        -6    11      25         88        64
56     0        96          0        52    -4      40         44         4
50    -1        89         -7        50     0      39         40         2
53     9        79          0        42    -2      25         37        12
55     2        82          0        54    -6      26         28         2
..   ...       ...        ...       ...   ...     ...        ...       ...
80     0        84          0       -36   -29       4        120       116
55     0        81          0       -20    25      26        102        76
55     0        77          0        12   -22      22         65        42
37     0       103          0        18   -16      66         85        20
56     2        98          0        52     1      42         46         4

    class
55      4
56      4
50      1
53      4
55      1
..    ...
80      5
55      4
55      4
37      1
56      4

[14500 rows x 9 columns]

Let's verify that this worked by looking at the `head()` function.

In [236]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [237]:
# your code here
shuttle.to_csv(r'../data/shuttle.csv', sep=",", header=None)

# Challenge 4 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [49]:
# your code here
!pip install xlrd

Requirement already satisfied: xlrd in /home/sandra/miniconda3/envs/ironhack_env/lib/python3.7/site-packages (1.2.0)

Use the `head()` function to inspect the dataframe.

In [109]:
# your code here
df_excel = pd.read_excel('../data/astronauts.xls')

df_excel.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [128]:
# your code here
df_excel[['Undergraduate Major']]

          Undergraduate Major
0                     Geology
1         Engineering Physics
2                 Engineering
3         Applied Mathematics
4      Mechanical Engineering
..                        ...
352    Electrical Engineering
353                   Physics
354          Military Science
355  Aeronautical Engineering
356               Mathematics

[357 rows x 1 columns]

In [137]:
df_excel.rename(columns={'Undergraduate Major': 'U_major'}, inplace=True)

In [139]:
df_excel.U_major.value_counts()

Physics                     35
Aerospace Engineering       33
Mechanical Engineering      30
Aeronautical Engineering    28
Electrical Engineering      23
                            ..
Geosciences                  1
Ceramic Engineering          1
Business Finance             1
Animal Science               1
Military Science             1
Name: U_major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [144]:
# your code here
df_excel.to_csv(r'../data/astronaut.csv', sep=" ", header=None)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [92]:
# your code here
!pip install requests

Requirement already satisfied: requests in /home/sandra/miniconda3/envs/ironhack_env/lib/python3.7/site-packages (2.23.0)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /home/sandra/miniconda3/envs/ironhack_env/lib/python3.7/site-packages (from requests) (1.25.8)
Requirement already satisfied: idna<3,>=2.5 in /home/sandra/miniconda3/envs/ironhack_env/lib/python3.7/site-packages (from requests) (2.9)
Requirement already satisfied: certifi>=2017.4.17 in /home/sandra/miniconda3/envs/ironhack_env/lib/python3.7/site-packages (from requests) (2020.4.5.1)
Requirement already satisfied: chardet<4,>=3.0.2 in /home/sandra/miniconda3/envs/ironhack_env/lib/python3.7/site-packages (from requests) (3.0.4)

In [91]:
import requests as rq

In [98]:
response = rq.get('https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt')
if response.status_code == 200:
    print('Success!')
elif response.status_code == 404:
    print('Not Found.')

Success!

In [104]:
fertility = rq.get('https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt')
with open('../data/fertility.txt', 'wb') as f:
    f.write(fertility.content)

In [106]:
fertility_txt = pd.read_csv('../data/fertility.txt', sep=",", header=None)

fertility_txt.head()

      0     1  2  3  4  5    6  7     8  9
0 -0.33  0.69  0  1  1  0  0.8  0  0.88  N
1 -0.33  0.94  1  0  1  0  0.8  1  0.31  O
2 -0.33  0.50  1  0  0  0  1.0 -1  0.50  N
3 -0.33  0.75  0  1  1  0  1.0 -1  0.38  N
4 -0.33  0.67  1  1  0  0  0.8 -1  0.50  O